---
kind: method
id: M:Autodesk.Revit.DB.CurveLoop.Flip
source: html/a7067941-9bcf-791b-9f1f-ae6284332e54.htm
---
# Autodesk.Revit.DB.CurveLoop.Flip Method

Reverses the orientation of the curve loop.

## Syntax (C#)
```csharp
public void Flip()
```